#This file synthesizes sv to gate level.
#Author:Pranav Prabhu

#read SV file
read_verilog -vs /foss/designs/rtl/ShiftRows.sv

#heirarchy
hierarchy -check -top ShiftRows

proc;opt

check

#compile into sky130nm
synth_sky130 -top ShiftRows

#stat of synthesis
stat

